const datalist_shinkansen = [
  ['JR東日本', '東北新幹線', '仙台〜白石蔵王', '45.0', '713.7', '2026-01-19', 'false'],
  ['JR東海', '東海道新幹線', '東京〜新大阪', '552.6', '552.6', '2018-03-10', 'true'],
  ['JR西日本', '山陽新幹線', '新大阪〜博多', '622.3', '622.3', '不明', 'true'],
  ['JR九州', '西九州新幹線', '嬉野温泉〜武雄温泉', '10.9', '69.6', '2023-08-06', 'false']
];

const datalist_jr = [
  ['JR東日本', '仙石線', 'あおば通〜松島海岸', '23.6', '50.2', '2026-01-18', 'false'],
  ['JR東日本', '仙山線', '仙台〜愛子', '15.2', '58.0', '2026-01-19', 'false'],
  ['JR東日本', '東北本線', '上野〜東京、仙台〜白石', '3.6、45.2', '535.3', '2026-01-19', 'false'],
  ['JR東日本', 'JY山手線', '上野〜新宿(品川経由)', '23.3', '34.5', '2025-08-14', 'false'],
  ['JR東日本', 'JS湘南新宿ライン、一部東海道支線品鶴線', '横浜〜新宿、うち支線鶴見〜大崎', '28.5、一部17.8', '589.5', '2023-03-??', 'false'],
  ['JR東日本・JR東海・JR西日本', '東海道本線', '東京〜上野、神戸〜熱田', '28.8、224.2', '589.5', '2023-0?-??', 'false'],
  ['JR西日本', 'E/A山陰本線', '京都〜馬堀、福知山〜豊岡', '18.1、38.4', '673.8', '不明', 'false'],
  ['JR西日本', 'G福知山線', '尼崎〜福知山', '106.5', '106.5', '不明', 'true']
];
